// SPDX-FileCopyrightText: 2024 German Aerospace Center (DLR)
// SPDX-License-Identifier: CC0-1.0

{
  welcomeModalSlides: {
    slide1: {
      title: 'Willkommen!',
      content: '\nSchön, dass Sie ESID nutzen. <br/><br/>  ESID ist eine Plattform, die Sie bei Ihren Aufgaben im Infektionsschutz unterstützen soll.<br/><br/> ✓ Erste Aufgabe erledigen<br/> ✓ Nächste Schritte verstehen\n    ',
    },
    slide2: {
      title: 'ESID kann Sie unterstützen',
      content: '✓ bei der Überwachung des (lokalen) Infektionsgeschehens. <br/> ✓ bei der Bewertung, wie sich eine Infektionsdynamik in der Zukunft voraussichtlich verändern wird. <br/> ✓ bei der Planung von effektiven (lokalen) Interventionsstrategien zur Eindämmung einer Infektionskrankheit. ',
    },
    slide3: {
      title: 'Wie unterstützt Sie ESID bei der Überwachung?',
      content: '✓ Sie können Infektionsherde auf einer Deutschlandkarte leicht identifizieren. <br/>✓ Sie können die Veränderung von Fallzahlen im Laufe der Zeit in einem anschaulichen Diagramm verfolgen.',
    },
    slide4: {
      title: 'Wie unterstützt Sie ESID bei der Bewertung?',
      content: '✓ Sie können sich die voraussichtliche, zukünftige Entwicklung der Fallzahlen durch verschiedene Szenarien anzeigen lassen.',
    },
    slide5: {
      title: 'Wie unterstützt Sie ESID bei der Planung?',
      content: '✓ Sie können die voraussichtliche, zukünftige Entwicklung der Fallzahlen in der Zukunft vergleichen, indem Sie verschiedene Szenarien betrachten, zum Beispiel mit oder ohne Maskenpflicht. <br/> ✓ Aus diesem Vergleich können Sie eine effektive Eindämmungsstrategie ableiten. ',
    },
    slide6: {
      title: 'Machen Sie eine Onboarding-Tour! ',
      content: 'Klicken Sie auf die Chips unten, um eine Tour durch die Plattform zu machen. Sie können die Touren auch später noch aufrufen, indem Sie auf das Hilfesymbol klicken.',
    },
  },
  chooseTour: 'Wählen Sie eine Tour',
  maybeLater: 'Vielleicht später',
  toolTipText: 'Dies ist die schwebende Schaltfläche für Hilfe.',
  completedTours: 'Sie haben alle Onboarding-Touren abgeschlossen.',
  completedToursContent: 'Sie können eine Tour jederzeit wiederholen, indem Sie auf die unten stehenden Optionen klicken.',
  getStarted: 'Erkunden Sie ESID durch unsere Einführungsveranstaltungen',
  getStartedContent: 'Damit Sie sich mit ESID vertraut machen können, haben wir mehrere Einführungsrundgänge vorbereitet. Klicken Sie unten auf eine Tour, um die wichtigsten Funktionen in Ihrem eigenen Tempo zu erkunden.',
  completed: 'abgeschlossen',
  next: 'Weiter',
  back: 'Zurück',
  skip: 'Überspringen',
  last: 'Letzter',
  tourAccessAlertTitle: 'Tour-Hinweis',
  lineChartTourAlertMessage: 'Um diese Tour zu starten, müssen Sie sich auf der Registerkarte Zeitreihen befinden.',
  parameterTourAlertMessage: 'Um diese Tour zu starten, müssen Sie sich auf der Registerkarte Parameter befinden.',
  tours: {
    districtMap: {
      title: 'Bezirkskarte',
      steps: {
        step1: {
          target: '#sidebar-root',
          title: 'Schritt 1',
          content: 'Die Kreiskarte zeigt eine Karte von Deutschland. Sie dient als Choropleth-Karte für geographisch verteilte Daten nach Landkreisen. Sie können einen anderen Bezirk auswählen, um Daten in anderen Komponenten zu filtern ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right-start',
        },
        step2: {
          target: '#sidebar-root',
          title: 'Schritt 2',
          content: 'Um einen detaillierteren Überblick zu erhalten, können Sie die Karte mit dem Plus- oder Minus-Symbol oder dem Mausrad vergrößern oder verkleinern. Mit der Schaltfläche Zurücksetzen können Sie die Karte auf ihre Standardansicht zurücksetzen',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right',
        },
        step3: {
          target: '#side-bar-heat-legend',
          title: 'Schritt 3',
          content: 'Die Bezirkskarte verfügt außerdem über eine anpassbare Wärmelegende, mit der Sie verschiedene Farbschemata auswählen können',
          disableBeacon: true,
          showProgress: true,
          placement: 'right',
        },
        step4: {
          target: '#sidebar-map-search-bar-wrapper',
          title: 'Schritt 4',
          content: 'Es gibt auch eine Suchleiste mit einer Autovervollständigungsfunktion, die Ihnen hilft, den Bezirk ohne geografische Kenntnisse zu finden',
          disableBeacon: true,
          showProgress: true,
          placement: 'right-start',
        },
      },
    },
    scenario: {
      title: 'Szenario',
      steps: {
        step1: {
          target: '#scenario-container',
          title: 'Schritt 1',
          content: 'In diesem Abschnitt werden die verschiedenen Szenariokarten dargestellt. Szenarien zeigen ein zusammenhängendes Bild der möglichen Entwicklung eines Infektionsereignisses ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step2: {
          target: '#main-card-external-container-0',
          title: 'Schritt 2',
          content: 'Die Karte mit den geschätzten Fällen zeigt Daten für ein ausgewähltes Fach zu einem bestimmten Datum und für einen bestimmten Bezirk an, ohne szenariospezifische Daten. Sie ermöglicht es Ihnen, ein Fach auszuwählen, auf das Sie sich konzentrieren möchten. Die Daten für das Szenario "Geschätzte Fälle" zeigen Daten bis zum heutigen Tag an.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step3: {
          target: '#scenario-view-compartment-list-date',
          title: 'Schritt 3',
          content: 'Das Referenzdatum wird verwendet, um Veränderungen in der Inzidenz von Infektionen im Laufe der Zeit zu visualisieren. Das Referenzdatum bildet den Bezug zu dem ausgewählten Tag im Liniendiagramm (dargestellt durch die lila Linie). Das Referenzdatum wird auch durch eine gestrichelte Linie dargestellt, die zum Liniendiagramm führt. Wenn Sie auf das kleine Kalendersymbol klicken, können Sie das Bezugsdatum ändern ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step4: {
          target: '#compartments-list',
          title: 'Schritt 4',
          content: 'Unterhalb des Referenztages befindet sich eine Liste von Infektionsstatus, wie z.B. infiziert, hospitalisiert und tot. Der Wert rechts neben dem Infektionsstatus gibt die Anzahl der Menschen mit dem entsprechenden Infektionsstatus in einer bestimmten Stadt oder einem bestimmten Bezirk an. Wenn Sie auf den jeweiligen Infektionsstatus klicken, ändern sich die Karte auf der linken Seite und das Liniendiagramm darunter und passen sich den Zahlenwerten für den ausgewählten Infektionsstatus an.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step5: {
          target: '#card-container',
          title: 'Schritt 5',
          content: 'Die Szenariokarten zeigen die Daten für ein ausgewähltes Szenario über alle Fächer, zu einem bestimmten Datum und für einen bestimmten Bezirk. Das Basisszenario (blau) stellt den Infektionsverlauf ohne Maßnahmen dar. Verschiedene Werte des Infektionsstatus werden im Szenariokasten angezeigt. Um eine Szenariokarte zu aktivieren, klicken Sie auf das Häkchen unten links auf der Karte, woraufhin die Szenariodaten im Liniendiagramm angezeigt werden',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step6: {
          target: '#card-container',
          title: 'Schritt 6',
          content: 'Die Szenario-Werte geben die Anzahl der Personen mit einem bestimmten Infektionsstatus innerhalb eines bestimmten Szenarios an. Die Werte der Szenarien werden in dem Liniendiagramm unten und auf der Karte visualisiert.  Jedes Szenario hat einen Anfang und ein Ende. Das Szenario der geschätzten Fälle (in schwarz) beginnt ein Jahr früher und endet am aktuellen Tag. Das Basisszenario (in blau) beginnt am aktuellen Tag und endet nach 28 Tagen. Der Zeitraum wird im Liniendiagramm durch eine Linie in der Farbe des jeweiligen Szenarios dargestellt',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step7: {
          target: '#scenario-add-button',
          title: 'Schritt 7',
          content: 'Mit der Schaltfläche Hinzufügen können Sie eine neue Szenariokarte zum Szenariocontainer hinzufügen',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
      },
    },
    filter: {
      title: 'Filter',
      steps: {
        step1: {
          target: '#manage-filters-button',
          title: 'Schritt 1',
          content: 'Filter bieten konfigurierbare Optionen für altersgruppenbasierte Filterung. Damit können Sie die Daten auf der Grundlage von Altersgruppen filtern. Klicken Sie hier, um die Filteroptionen zu erkunden',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideCloseButton: true,
          hideFooter: true,
          placement: 'left-start',
        },
        step2: {
          target: '#manage-filters-dialog',
          title: 'Schritt 2',
          content: 'Hier können Sie die Filteroptionen verwalten. Sie können eine vorhandene Filterkarte auswählen, um sie zu bearbeiten oder zu löschen, oder Sie können eine neue Filterkarte hinzufügen',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideBackButton: true,
          placement: 'bottom',
        },
        step3: {
          target: '#group-filter-add-card',
          title: 'Schritt 3',
          content: 'Sie können einen neuen Filter hinzufügen, indem Sie auf diese Schaltfläche klicken. Nach der Auswahl eines Filters werden die gefilterten Werte im Szenariokasten angezeigt. Klicken Sie dazu auf den Pfeil neben dem Szenariokasten, um die Szenariowerte mit dem angewendeten Filter zu sehen',
          disableBeacon: true,
          showProgress: true,
          disableOverlayClose: true,
          spotlightClicks: false,
        },
      },
    },
    lineChart: {
      title: 'Liniendiagramm',
      steps: {
        step1: {
          target: '#chartdiv',
          title: 'Schritt 1',
          content: 'Dieser Abschnitt stellt ein Liniendiagramm dar, in dem die Szenarien über eine vordefinierte Zeitachse verglichen werden. Es zeigt die Entwicklung der Szenarien für einen ausgewählten Infektionsstatus entlang einer Zeitachse in einem bestimmten ländlichen oder städtischen Bezirk. Die Y-Achse zeigt die Anzahl der Menschen mit dem entsprechenden Infektionsstatus, die X-Achse zeigt die Zeitspanne. Wenn Sie die Szenarien, den Infektionsstatus oder den ländlichen oder städtischen Bezirk ändern, passt sich das Liniendiagramm an die entsprechenden Werte an',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#chartdiv',
          title: 'Schritt 2',
          content: 'Mit Hilfe des blau-lila gefärbten Datums innerhalb des Liniendiagramms können die Werte des Szenarios für einen bestimmten Tag auf der Karte und im Szenariokasten angezeigt werden. Dieses Datum können Sie mit der Maus nach Belieben verschieben. Die Werte in der Szenariobox und auf der Karte ändern sich entsprechend, da sie sich immer auf das im Liniendiagramm ausgewählte Datum beziehen',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step3: {
          target: '#chartdiv',
          title: 'Schritt 3',
          content: 'Die Unsicherheiten in den computergestützten und mathematischen Vorhersagen werden im Liniendiagramm als schattierte Fläche dargestellt. Die Quantifizierungen der Unsicherheiten können nur angezeigt werden, wenn Sie in den entsprechenden Bereich hineinzoomen',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step4: {
          target: '#chartdiv',
          title: 'Schritt 4',
          content: 'Sie können mit der Maus in das Liniendiagramm hinein- oder herauszoomen, um einen Ausschnitt im Detail anzuzeigen. Wenn Sie auf das Minus-Symbol klicken, können Sie die Ansicht des Liniendiagramms auf den Standardzustand zurücksetzen.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
      },
    },
    parameters: {
      title: 'Parameter',
      steps: {
        step1: {
          target: '#table-container',
          title: 'Schritt 1',
          content: 'In dieser Ansicht "Parameter" ist anstelle des Diagramms eine Tabelle mit Modellparametern sichtbar. Die aufgeführten Parameter werden für die Modellierung und damit für die Simulation der Szenarien verwendet',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#table-container',
          title: 'Schritt 2',
          content: 'Die Parameter dienen als Basisinformationen für Spezialisten mit spezifischen epidemiologischen Kenntnissen. Sie können nur eingesehen, aber nicht verändert warden. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
      },
    },
  },
}
