// SPDX-FileCopyrightText: 2024 German Aerospace Center (DLR)
// SPDX-License-Identifier: CC0-1.0

{
  welcomeModalSlides: {
    slide1: {
      title: 'Willkommen!',
      content: '\nSchön, dass Sie ESID nutzen. <br/><br/> ESID ist eine Plattform, die Sie bei Ihren Aufgaben im Infektionsschutz unterstützen soll.<br/><br/> ✓ Erste Aufgabe erledigen<br/> ✓ Nächste Schritte verstehen\n    ',
    },
    slide2: {
      title: 'ESID kann Sie unterstützen',
      content: '✓bei der Überwachung des (lokalen) Infektionsgeschehens. <br/><br/> ✓ bei der Bewertung, wie sich eine Infektionsdynamik in der Zukunft voraussichtlich verändern wird. <br/><br/> ✓ bei der Planung von effektiven (lokalen) Interventionsstrategien zur Eindämmung einer Infektionskrankheit. ',
    },
    slide3: {
      title: 'Wie unterstützt Sie ESID bei der Überwachung?',
      content: '✓Sie können Infektionsherde auf einer Deutschlandkarte leicht identifizieren. <br/><br/>✓\tSie können die Veränderung von Fallzahlen im Laufe der Zeit in einem anschaulichen Diagramm verfolgen.',
    },
    slide4: {
      title: 'Wie unterstützt Sie ESID bei der Bewertung?',
      content: '✓\tSie können sich die voraussichtliche, zukünftige Entwicklung der Fallzahlen durch verschiedene Szenarien anzeigen lassen.',
    },
    slide5: {
      title: 'Wie unterstützt Sie ESID bei der Planung?',
      content: '✓\tSie können die voraussichtliche, zukünftige Entwicklung der Fallzahlen in der Zukunft vergleichen, indem Sie verschiedene Szenarien betrachten, zum Beispiel mit oder ohne Maskenpflicht. <br/><br/> ✓\tAus diesem Vergleich können Sie eine effektive Eindämmungsstrategie ableiten. ',
    },
    slide6: {
      title: 'Machen Sie eine Onboarding-Tour! ',
      content: 'Klicken Sie auf die Chips unten, um eine Tour durch die Plattform zu machen. Sie können die Touren auch später noch aufrufen, indem Sie auf das Hilfesymbol klicken.',
    },
  },
  chooseTour: 'Wählen Sie eine Tour',
  maybeLater: 'Vielleicht später',
  toolTipText: 'Dies ist die schwebende Schaltfläche für Hilfe.',
  congrats: 'Herzlichen Glückwunsch!',
  congratsContent: 'Sie haben die Touren erfolgreich abgeschlossen. Sie haben die Touren erfolgreich abgeschlossen. Sie können eine Tour jederzeit wiederholen, indem Sie auf die Chips unten klicken.',
  getStarted: 'Starten Sie mit ESID',
  getStartedContent: 'Wählen Sie eine der untenstehenden Touren aus, um jede Funktion im Detail zu erkunden und zu verstehen.',
  next: 'Weiter',
  back: 'Zurück',
  skip: 'Überspringen',
  last: 'Letzter',
  tourAccessAlertTitle: 'Tour-Hinweis',
  lineChartTourAlertMessage: 'Sie müssen auf der Registerkarte Liniendiagramm sein, um diese Tour zu starten.',
  tours: {
    districtMap: {
      title: 'Bezirkskarte',
      steps: {
        step1: {
          target: '#sidebar-root',
          title: 'Schritt 1',
          content: 'Die Kreiskarte zeigt eine Karte von Deutschland. Sie dient als Choropleth-Karte für geographisch verteilte Daten nach Landkreisen. Sie können einen anderen Bezirk auswählen, um Daten in anderen Komponenten zu filtern.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right-start',
        },
        step2: {
          target: '#sidebar-root',
          title: 'Schritt 2',
          content: 'Um einen detaillierteren Überblick zu erhalten, kann die Karte mit dem Plus- oder Minus-Symbol oder dem Mausrad vergrößert oder verkleinert werden.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right',
        },
        step3: {
          target: '#side-bar-heat-legend',
          title: 'Schritt 3',
          content: 'Die Stadtteilkarte verfügt auch über eine anpassbare Wärmelegende, bei der Sie verschiedene Farbschemata auswählen können. ',
          disableBeacon: true,
          showProgress: true,
          placement: 'right',
        },
        step4: {
          target: '#sidebar-map-search-bar-wrapper',
          title: 'Schritt 4',
          content: 'Es gibt auch eine Suchleiste mit einer Autovervollständigungsfunktion, die Ihnen hilft, den Bezirk ohne geografische Kenntnisse zu finden.',
          disableBeacon: true,
          showProgress: true,
          placement: 'right-start',
        },
      },
    },
    scenario: {
      title: 'Szenario',
      steps: {
        step1: {
          target: '#scenario-container',
          title: 'Schritt 1',
          content: 'Dieser Abschnitt stellt die verschiedenen Szenariokarten dar. Szenarien zeigen ein zusammenhängendes Bild der möglichen Entwicklung eines Infektionsereignisses.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step2: {
          target: '#main-card-external-container-0',
          title: 'Schritt 2',
          content: 'Die Karte mit den geschätzten Fällen zeigt Daten für ein ausgewähltes Fach, für ein bestimmtes Datum und für einen bestimmten Bezirk an, ohne szenariospezifische Daten. Sie ermöglicht es dem Benutzer, ein Fach auszuwählen, auf das er sich konzentrieren möchte.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step3: {
          target: '#card-container',
          title: 'Schritt 3',
          content: 'Die Szenariokarten zeigen die Daten für ein ausgewähltes Szenario in allen Fächern, zu einem bestimmten Datum und für einen bestimmten Bezirk an. Sie ermöglichen es dem Benutzer, ein Szenario auszuwählen, auf das er sich konzentrieren möchte. Die Szenario-Werte geben die Anzahl der Personen mit einem bestimmten Infektionsstatus innerhalb eines bestimmten Szenarios an',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step4: {
          target: '#card-container',
          title: 'Schritt 4',
          content: 'Um eine Szenariokarte zu aktivieren, klicken Sie auf das Häkchen unten links auf der Karte. Dadurch werden die Szenariodaten im Liniendiagramm angezeigt.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step5: {
          target: '#scenario-add-button',
          title: 'Schritt 5',
          content: 'Mit der Schaltfläche "Hinzufügen" können Sie eine neue Szenariokarte zum Szenariocontainer hinzufügen.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step6: {
          target: '#scenario-datepicker-box',
          title: 'Schritt 6',
          content: 'Links von den Szenariokarten befindet sich eine Liste von Infektionszuständen oder Aggregationen von Infektionszuständen, wie infiziert, hospitalisiert und tot',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
      },
    },
    filter: {
      title: 'Filter',
      steps: {
        step1: {
          target: '#manage-filters-button',
          title: 'Schritt 1',
          content: 'Filter bieten konfigurierbare Optionen für altersgruppenbasierte Filterung. Damit können Sie die Daten auf der Grundlage von Altersgruppen filtern. Klicken Sie hier, um die Filteroptionen zu erkunden. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideCloseButton: true,
          hideFooter: true,
          placement: 'left-start',
        },
        step2: {
          target: '#manage-filters-dialog',
          title: 'Schritt 2',
          content: 'Hier können Sie die Filteroptionen verwalten. Sie können eine vorhandene Filterkarte auswählen, um sie zu bearbeiten oder zu löschen, oder Sie können eine neue Filterkarte hinzufügen.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideBackButton: true,
        },
        step3: {
          target: '#group-filter-add-card',
          title: 'Schritt 3',
          content: 'Klicken Sie hier, um eine neue Altersgruppenfilterkarte hinzuzufügen. ',
          disableBeacon: true,
          showProgress: true,
          disableOverlayClose: true,
          spotlightClicks: false,
        },
      },
    },
    lineChart: {
      title: 'Line Chart',
      steps: {
        step1: {
          target: '#chartdiv',
          title: 'Schritt 1',
          content: 'Dieser Abschnitt stellt ein Liniendiagramm dar, in dem die Szenarien über eine vordefinierte Zeitachse verglichen werden. Er zeigt die Entwicklung der Szenarien für einen ausgewählten Infektionsstatus entlang einer Zeitachse.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#chartdiv',
          title: 'Schritt 2',
          content: 'Das Diagramm zeigt Daten für alle Szenarien für ein ausgewähltes Fach über alle Daten für einen bestimmten Bezirk an. Es dient als Auswahlwerkzeug für Daten und ermöglicht es dem Benutzer, Trends im Laufe der Zeit zu sehen.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step3: {
          target: '#chartdiv',
          title: 'Schritt 3',
          content: 'Versuchen Sie, auf die Markierungen im Diagramm zu klicken, um die Daten für ein bestimmtes Datum zu sehen.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step4: {
          target: '#tab-parameter-editor',
          title: 'Schritt 4',
          content: 'Das Liniendiagramm verfügt auch über einen Parameter-Editor, mit dem Sie Parameter für verschiedene Szenarien anzeigen können. Versuchen Sie es mit einem Klick auf die Registerkarte Paramter!',
          disableBeacon: true,
          spotlightClicks: true,
          disableOverlayClose: true,
          hideBackButton: true,
          hideFooter: true,
        },
      },
    },
  },
}
