// SPDX-FileCopyrightText: 2024 German Aerospace Center (DLR)
// SPDX-License-Identifier: CC0-1.0

{
  imprint: {
    header: 'Imprint',
    content: '\
      <div>\
        <h2>Imprint according to Section § 5 TMG (German Telemedia Act) and § 18 Medienstaatsvertrag (German State Media Treaty) Deutsches Zentrum fuer Luft- und Raumfahrt e. V.</h2>\
        <p>\
          German Aerospace Center (DLR)<br />\
          Linder Höhe<br />\
          51147 Köln (Cologne)<br />\
          Tel: +49 2203 601-0<br />\
          Fax: +49 2203 67310<br />\
          email: contact-hpc-against-corona [at] dlr.de<br />\
          WWW:&nbsp;<a href="https://www.dlr.de/en" target="_blank" rel="noopener noreferrer">https://www.dlr.de/en/</a>\
        </p>\
        <p>\
          DLR\'s Executive Board is empowered to act as DLR\'s representative. It consists of Prof. Dr.-Ing. Anke\
          Kaysser-Pyzalla (Chair of the DLR Executive Board), Klaus Hamacher (Vice Chairman of the Executive\
          Board), Prof. Dr. rer. nat. Hansjörg Dittus, Prof. Dr.-Ing. Karsten Lemmer and Dr.-Ing. Walther Pelzer.\
        </p>\
        <p>\
          <b>Seat of the Executive Board:</b><br />\
          The Executive Board\'s seat is located at DLR, Executive Board, Linder Höhe, D-51147 Cologne.\
        </p>\
        <p>\
          The Executive Board can also authorise DLR employees to act on behalf of DLR. The head of DLR\'s legal\
          department, Linder Hoehe, 51147 Cologne, can provide information about the extent of this authorisation.\
        </p>\
        <p>\
          <b>Court of registration/registration number:</b><br />\
          District court of Bonn, VR 2780.\
        </p>\
        <p>\
          <b>Value added tax identification number:</b><br />\
          DE 121965658\
        </p>\
        <h3>Responsible in the sense of Section § 18 2nd paragraph of Medienstaatsvertrag (German State Media Treaty):</h3>\
        <p>\
          <i>Martin J. Kühn, Linder Höhe, 54117 Köln</i>\
        </p>\
        <h3>The Portal is maintained by:</h3>\
        <p>\
          <b>Deutsches Zentrum fuer Luft- und Raumfahrt e. V. (DLR) | German Aerospace Center (DLR)</b><br />\
          Institute for Software Technology<br />\
          Linder Höhe<br />\
          51147 Köln (Cologne)<br />\
          Germany\
        </p>\
        <p>\
          <b>Redaktion:</b><br />\
          <i>Martin J. Kühn</i>\
        </p>\
        <p>\
          <b>Responsible for Content:</b><br />\
          Martin J. Kühn (German Aerospace Center (DLR)) <br />\
          Michael Meyer-Hermann (Helmholtz Centre for Infection Research (HZI)) <br />\
          Sebastian Binder (Helmholtz Centre for Infection Research (HZI)) <br />\
        </p>\
        <h3>Liability:</h3>\
        <p>\
          According to section 7 first paragraph of the German Telemedia Act, DLR as the content provider is\
          responsible for its own content which it provides for use on this website, in accordance with the\
          general laws. Cross-references ("links") to content provided by other content providers must be\
          distinguished from DLR´s own content. By means of the cross-reference DLR provides third-party content\
          for use which is marked accordingly by the indication "[external]" or by a link. Before setting the\
          link DLR checks this third-party content if it causes possible civil or criminal liability. However, it\
          cannot be excluded that the third-party content provider change their content afterwards. DLR does not\
          constantly check the third-party content it refers to for changes made by the third-party content\
          providers which could engender DLR´s civil or criminal liability. If you believe that the linked\
          external sites violate applicable laws or otherwise have inappropriate content, please let us know.\
        </p>\
        <p>\
          <b>Technical Maintenance:</b><br />\
          email: dlr-infomaster [at] dlr.de\
        </p>\
        <p>\
          <b>DLR images and video – terms and conditions of use:</b><br />\
          The rights to all images and videos used on this website are owned by the German Aerospace Center\
          (Deutsches Zentrum für Luft- und Raumfahrt e.V.; DLR), unless otherwise stated.\
        </p>\
        <p>\
          Where expressly stated, DLR images and videos are covered by a\
          <a href="http://creativecommons.org/licenses/by/3.0/de" target="_blank" rel="noopener noreferrer">Creative Commons Attribution 3.0 Germany (CC BY 3.0) licence</a>.\
          This licence grants permission to reproduce or distribute the work, to make the work and/or its\
          contents publically available, to alter or edit the work and/or its contents and to make commercial use\
          of the work, provided that you explicitly mention DLR as its source in a clearly legible format.\
          Examples: \'Photo: DLR, CC-BY 3.0\', \'Images: DLR, CC-BY 3.0\', \'Video: DLR, CC-BY 3.0\'.\
        </p>\
        <p>\
          The licence has no influence on the following rights:\
        </p>\
        <p>\
          The rights to which everyone is entitled through copyright law or legal permission (in some countries,\
          established as the fundamental doctrine of fair use); the copyright entitlements of the legal owner;\
          rights of other persons, either with regard to the object of the licence itself or in reference to its\
          use, for example the personal rights of photographed persons.\
        </p>\
        <p>\
          Note: In the event of distribution, you must notify others of all licence conditions applicable to\
          this work. You will find detailed information and a legally binding licence contract\
          <a href="http://creativecommons.org/licenses/by/3.0/de/legalcode" target="_blank" rel="noopener noreferrer">here</a>.\
        </p>\
        <p>\
          Images and videos by DLR not indicated \'CC-BY 3.0\' are not licenced under the Creative Commons licence\
          model. Permission of use for these images and videos is granted as follows: They may be used by press\
          and other media, or for personal information or educational purposes. Commercial use is subject to DLR\
          permission.\
        </p>\
        <p>\
          Certain images (photos) and videos on the DLR web portal originate from other sources. If you wish to\
          use these images or videos, please contact the copyright holder.\
        </p>\
        <p>\
          Certain images and videos may have multiple copyright holders. In such cases, it is common practice to\
          apply the conditions of use applied by the copyright holder mentioned in the source reference. In cases\
          of doubt, please contact this person or entity. These images and videos are identified accordingly.\
        </p>\
        <p>\
          The Creative Commons licence does not extend to the DLR logo, its constituent elements or other\
          elements of DLR\'s corporate visual identity such as the "blue marble". The DLR logo must not be used\
          by persons who are not DLR employees or who have not been granted permission for its use by DLR.\
        </p>\
        <p><b>Should you have any questions, please contact:</b></p>\
        <p>\
          DLR German Aerospace Center<br />\
          Public Affairs and Communications Department, Communications Section<br />\
          Linder Höhe<br />\
          51147 Cologne<br />\
          Tel: +49 2203 601-2116<br />\
          Fax: +49 2203 601-3249<br />\
          email: bildredaktion [at] dlr.de\
        </p>\
      </div>',
  },
  'privacy-policy': {
    header: 'Privacy Policy',
    content: '\
      <p>\
        DLR takes the protection of personal data very seriously.\
        We want you to know when we store data, which types of data are stored and how it is used.\
        As an incorporated entity under German civil law, we are subject to the provisions of the\
        <a href="https://gdpr-info.eu/" target="_blank" title="External link  General Data Protection Regulation GDPR">EU General Data Protection Regulation (GDPR)</a>,\
        the <a href="https://www.gesetze-im-internet.de/englisch_bdsg/index.html" target="_blank" title="External link Federal Data Protection Act (BDSG)">Federal Data Protection Act (BDSG)</a>\
        and the <a href="http://www.gesetze-im-internet.de/tmg/" target="_blank" title="External link Bundesamt für Justiz - Telemediengesetz">Telemedia Act (TMG)</a>.\
        We have taken technical and organisational measures to ensure our compliance and the compliance of external service providers with the data protection regulation.\
      </p><p>\
        This website uses SSL – that is, TLS encryption – in order to protect the transfer of personal data and other\
        confidential information (for example, orders or enquiries sent to the controller).\
        A connection is encrypted if you see the character sequence \',https://\' and the padlock icon in your\
        browser\'s address bar.\
      </p><p>\
        <strong>I. Name and address of the controller</strong>\
      </p><p>\
        The controller in the meaning of the General Data Protection Regulation, other national data protection laws in\
        the Member States and related data protection regulations is:\
      </p><p>\
        Deutsches Zentrum für Luft- und Raumfahrt e. V. (DLR)<br />\
        Linder Höhe<br />\
        51147 Cologne\
      </p><p>\
        Telephone: +49 2203 601-0<br />\
        Email: datenschutz@dlr.de<br />\
        WWW: https://www.dlr.de</p>\
      <p />\
      <p>\
        <strong>II. Name and address of the data protection officer</strong>\
      </p><p>\
        The controller’s appointed data protection officer is:\
      </p><p>\
        Uwe Gorschütz, Deutsches Zentrum für Luft- und Raumfahrt e. V., Linder Höhe, 51147 Cologne<br />\
        Email: datenschutz@dlr.de\
      </p>\
      <p />\
      <p>\
        <strong>III. Definition of terms</strong>\
      </p><p>\
        Among others, we use the following terms in this Privacy Policy, set out in the General Data Protection\
        Regulation and the Federal Data Protection Act:\
      </p><p>\
        <em>1. Personal data</em>\
      </p><p>\
        Personal data refers to any information relating to an identified or identifiable natural person\
        (hereinafter: ‘data subject’).\
        An identifiable natural person is one who can be identified – directly or indirectly – in particular by\
        reference to an identifier such as a name, an identification number, location data, an online identifier or to\
        one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social\
        identity of that natural person.\
      </p><p>\
        <em>2. Data subject</em>\
      </p><p>\
        A data subject is any identified or identifiable natural person whose personal data is processed by the\
        controller.\
      </p><p>\
        <em>3. Processing</em>\
      </p><p>\
        Processing is any operation or set of operations performed on personal data or on sets of personal data –\
        whether or not by automated means – such as collection, recording, organisation, structuring, storage,\
        adaptation or alteration, retrieval, consultation, use, disclosure by transmission, dissemination or otherwise\
        making available, alignment or combination, restriction, deletion or destruction.\
      </p><p>\
        <em>4. Restriction of processing</em>\
      </p><p>\
        Restriction of processing means the marking of stored personal data with the aim of limiting its processing in\
        the future.\
      </p><p>\
        <em>5. Profiling</em>\
      </p><p>\
        Profiling means any form of automated processing of personal data consisting of the use of personal data to\
        evaluate certain personal aspects relating to a natural person, in particular to analyse or predict aspects\
        concerning that natural person’s performance at work, economic situation, health, personal preferences,\
        interests, reliability, behaviour, location or movements.\
      </p><p>\
        <em>6. Pseudonymisation</em>\
      </p><p>\
        Pseudonymisation means the processing of personal data in such a manner that the personal data can no longer be\
        attributed to a specific data subject without the use of additional information, provided that such additional\
        information is kept separately and is subject to technical and organisational measures to ensure that the\
        personal data are not attributed to an identified or identifiable natural person.\
      </p><p>\
        <em>7. Controller or data processing controller</em>\
      </p><p>\
        Controller or data processing controller means the natural or legal person, public authority, agency or other\
        body which, alone or jointly with others, determines the purposes and means of the processing of personal data;\
        where the purposes and means of such processing are determined by Union or Member State law, the controller or\
        the specific criteria for its nomination may be provided for by Union or Member State law.\
      </p><p>\
        <em>8. Processor</em>\
      </p><p>\
        Processor means a natural or legal person, public authority, agency or other body that processes personal data\
        on behalf of the controller.\
      </p><p>\
        <em>9. Recipient</em>\
      </p><p>\
        Recipient means a natural or legal person, public authority, agency or another body, to which the personal data\
        are disclosed, whether a third party or not.\
        However, public authorities that may receive personal data in the framework of a particular inquiry in\
        accordance with Union or Member State law shall not be regarded as recipients.\
      </p><p>\
        <em>10. Third party</em>\
      </p><p>\
        Third party means a natural or legal person, public authority, agency or body other than the data subject,\
        controller, processor and persons who, under the direct authority of the controller or processor, are\
        authorised to process personal data.\
      </p><p>\
        <em>11.Consent</em>\
      </p><p>\
        Consent of the data subject means any freely given, specific, informed and unambiguous indication of the data\
        subject’s wishes by which he or she, by a statement or by a clear affirmative action, signifies agreement to\
        the processing of personal data relating to him or her.\
      </p>\
      <p />\
      <p>\
        <strong>IV. General information on data processing</strong>\
      </p><p>\
        <em>1. Scope of processing of personal data</em>\
      </p><p>\
        We process personal data concerning our users exclusively to the extent required to provide a functioning\
        website, as well as our content and services. Ordinarily, we will only process the personal data of our users\
        after obtaining their consent.\
        An exception to this rule is where obtaining prior consent is factually impossible and the processing of the\
        data is permitted by law.\
      </p><p>\
        <em>2. Legal grounds for the processing of personal data</em>\
      </p><p>\
        Where we obtain consent from the data subject for the processing of personal data, the legal grounds are set\
        out in Art. 6, paragraph 1, part (a) of the EU General Data Protection Regulation (GDPR).\
      </p><p>\
        Where personal data is processed for the performance of a contract in which the data subject is a contractual\
        partner, the legal grounds are set out in Art. 6, paragraph 1, part (b) of the GDPR.\
        This also applies to processing that is necessary for pre-contractual measures.\
      </p><p>\
        Where personal data is processed for compliance with a legal obligation to which our research centre is\
        subject, the legal grounds are set out in Art. 6, paragraph 1, part (c) of the GDPR.\
      </p><p>\
        Where processing of personal data is necessary for the protection of vital interests of the data subject or\
        another natural person, the legal grounds are set out in Art. 6, paragraph 1, part (d) of the GDPR.\
      </p><p>\
        Where processing is necessary for the legitimate interests of our research centre or a third party, and where\
        the fundamental rights and freedoms of the data subject do not override the first interests, the legal grounds\
        are set out in Art. 6, paragraph 1, part (f) of the GDPR.\
      </p><p>\
        <em>3. Data deletion and duration of data storage</em>\
      </p><p>\
        The personal data of the data subject will be deleted or blocked as soon as the purpose of storage no longer\
        applies.\
        In addition, storage takes place if authorised by Union or Member State directives, laws or other regulations\
        to which the controller is subject. Blocking or deletion of the data shall also take place when a storage\
        period stipulated by one of the above standards comes to an end, except where it is necessary to continue\
        storing the data to enter into or perform a contract.\
      </p>\
      <p />\
      <p>\
        <strong>V. Provision of the website and generation of log files</strong>\
      </p><p>\
        <em>a) Description and scope of data processing</em>\
      </p><p>\
        Our system automatically collects data and information from the accessing computer system each time our website\
        is visited.\
      </p><p>\
        The following data is collected in this context:\
      </p>\
      <ol>\
        <li>Information about the browser type and version</li>\
        <li>The user’s operating system</li>\
        <li>The user’s Internet Service Provider</li>\
        <li>The user’s IP address</li>\
        <li>The date and time of access</li>\
        <li>Referrer website(s)</li>\
        <li>Websites accessed by the user from our website</li>\
      </ol>\
      <p>\
        The data is also stored in log files kept on our system.\
        This data is not stored together with other personal data concerning the user.\
      </p><p>\
        <em>b)&nbsp;Legal grounds for data processing</em>\
      </p><p>\
        The legal grounds for temporary storage of the data and log files are set out in Art. 6, paragraph 1, part (f)\
        of the EU General Data Protection Regulation (GDPR).\
      </p><p>\
        <em>c)&nbsp;Purpose of data processing</em>\
      </p><p>\
        Temporary storage of the IP address by our system is necessary to deliver the website to the computer of the\
        user.\
        For this purpose, the user’s IP address must be stored for the duration of the session.\
      </p><p>\
        Storage in log files takes place to ensure functionality of the website.\
        In addition, the data is used to optimise the website and to ensure security of our Information Technology\
        systems.\
        Data analysis for marketing purposes does not take place in this context.\
      </p><p>\
        The DLR website collects a variety of general data and information each time it is accessed by a data subject\
        or an automated system.\
        This general data and information is stored in server log files.\
        The data and information collected include the (1) browser types and versions; (2) the operating system used by\
        the accessing system; (3) the website from which the accessing system arrives on our website (the referrer);\
        (4) the sub-pages visited by the accessing system; (5) the date and time of accessing our website; (6) an\
        Internet Protocol address (IP address); (7) the Internet service provider of the accessing system and (8) other\
        similar data and information that is used to protect against risks in the case of attacks on our Information\
        Technology systems.\
      </p><p>\
        DLR does not draw any conclusions about the identity of the data subject during use of this general data and\
        information.\
        Instead, this information is necessary to (1) deliver the contents of our website in their correct form; to (2)\
        optimise the contents of our website and promote it; to (3) guarantee the permanent functionality of our\
        information technology systems and equipment used for our website; and to (4) provide the information necessary\
        for law enforcement organisations to investigate cyber-attacks.\
        This anonymous data and information is analysed by DLR, firstly for statistical purposes, and secondly with the\
        objective of increasing data protection and data security at our research centre, and hence to achieve an\
        optimum level of protection for the personal data processed by us. The anonymous data contained in the server\
        log files is stored separately from all other personal data concerning the data subject.\
      </p><p>\
        These purposes justify our legitimate interests in data processing according to Art. 6, paragraph 1, part (f)\
        of the GDPR.\
      </p><p>\
        <em>d) Duration of storage</em>\
      </p><p>\
        The data is deleted as soon as it is no longer needed for the purpose for which it was collected.\
        In the case of data collection for the provision of this website, this applies at the end of each session.\
      </p><p>\
        In the case of data stored in log files, this occurs after no longer than seven days. Further storage is\
        possible; in these cases, the users’ IP addresses are deleted or pseudonymised to prevent any association with\
        the accessing client.\
      </p><p>\
        <em>e) Right to objection and removal</em>\
      </p><p>\
        The collection of data for the provision of our website and the storage of data in log files is crucial to\
        operation of the website. Hence, users are not granted a right to object.\
      </p>\
      <p />\
      <p>\
        <strong>VI. Use of cookies</strong>\
      </p><p>\
        <em>a) Description and scope of data processing</em>\
      </p><p>\
        Our website uses cookies.\
        Cookies are text files placed on the user’s computer system by a browser and stored there.\
      </p><p>\
        Numerous websites and servers use cookies.\
        Many cookies contain what is referred to as a cookie ID.\
        A cookie ID is a unique cookie identifier.\
        It consists of a sequence of characters with which Internet pages and servers can be assigned to the Internet\
        browser in which the cookie was stored.\
        This enables visited Internet pages and servers to distinguish the data subject’s individual browser from other\
        Internet browsers containing different cookies.\
        The unique cookie ID is used to recognise and identify a particular Internet browser.\
      </p><p>\
        The use of cookies allows DLR to provide visitors to this website more user-friendly services than would be\
        possible without cookies.\
      </p><p>\
        We use technically necessary cookies to improve our website’s user friendliness.\
        Some elements on our website make it necessary to recognise the accessing browser when moving from page to\
        page.\
        Cookies can be used to optimise the information and services on our website in the interests of our users.\
        As stated above, cookies allow us to recognise visitors to our website.\
        The purpose of this recognition is to facilitate use of our website by visitors.\
        For instance, visitors to a website that uses cookies do not need to enter login details during each visit, as\
        this information is obtained by the website from the cookie placed on the user’s computer system.\
      </p><p>\
        In addition, our website uses cookies to analyse Internet usage by visitors.\
      </p><p>\
        The following data can be transferred in this way:\
      </p>\
      <ul>\
        <li>Search terms entered</li>\
        <li>Frequency of page access</li>\
        <li>Usage of website functions</li>\
      </ul>\
      <p>\
        Technical measures are implemented to pseudonymise the data collected from users in this way.\
        It is therefore not possible to associate the data with the accessing user.\
        The data is not stored together with other personal data concerning the user.\
      </p><p>\
        An information banner referring users to the use of cookies for analysis purposes is shown when they access our\
        website, and reference to this Privacy Notice is provided.\
        Users are also informed of how to adjust their browser settings in order to prevent the storage of cookies.\
      </p><p>\
        Users are informed of our use of cookies for analysis purposes when accessing our website, and their consent to\
        the processing of personal data used in this context is obtained.\
        A reference to this Privacy Notice is provided as well.\
      </p><p>\
        Section IX contains a detailed description of data processing in connection with the web analysis tools that we\
        use.\
      </p><p>\
        <em>b) Legal basis for data processing</em>\
      </p><p>\
        i. The legal grounds for the processing of personal data using technically necessary cookies are set out in\
        Art. 6, paragraph 1, part (f) of the EU General Data Protection Regulation (GDPR).<br />\
        ii. The legal grounds for the processing of personal data using cookies for analysis purposes with consent of\
        the user are set out in Art. 6, paragraph 1, part (a) of the GDPR.\
      </p><p>\
        <em>c) Purpose of data processing</em>\
      </p><p>\
        Technically necessary cookies are used to make our website user friendly.\
        Some functions on our website cannot be provided without the use of cookies, as they require that the browser\
        is recognised when moving from page to page.\
      </p><p>\
        The user data collected with technically necessary cookies is not used to produce user profiles.\
      </p><p>\
        On the use of cookies that are not necessary for technical reasons:\
      </p><p>\
        Analysis cookies are used to improve the quality of our website and its contents.\
        Through the use of analysis cookies, we find out how the website is used and are therefore able to optimise our\
        service continuously.\
        A more precise description is contained under Section IX of this document.\
      </p><p>\
        These purposes represent our legitimate interest in processing personal data according to\
        Art. 6, paragraph 1, part (f) of the GDPR.\
      </p><p>\
        <em>e) Duration of storage; right to objection and removal</em>\
      </p><p>\
        The data subject can adjust the settings of the Internet browser at any time to prevent our website from\
        placing cookies as described, and therefore block cookies on a permanent basis.\
        In addition, the browser or other software programs can be used to delete cookies that have already been placed\
        at any time.\
        This is possible with all standard Internet browsers.\
        The data subject may not be able to use the full functionality of our website if cookies are disabled in the\
        active Internet browser.\
      </p><p>\
        You can change the settings of your Internet browser to disable or restrict the transfer of cookies at any\
        time.\
        Cookies that have already been placed on your computer can be deleted at any time.\
        This can take place automatically.\
        Disabling cookies may prevent you from using the full functionality of our website.\
      </p>\
      <p />\
      <p>\
        <strong>VII. Contact form and email contact</strong>\
      </p><p>\
        <em>a) Description and scope of data processing</em>\
      </p><p>\
        Our website includes a contact form that can be used to make contact with us by electronic means.\
        Where a data subject uses this option, the data entered in the input screen will be transferred to us and\
        stored.\
        This applies to the following data:\
      </p>\
      <ul>\
        <li>First name</li>\
        <li>Family name</li>\
        <li>Email address</li>\
      </ul>\
      <p>\
        The following data is stored additionally when sending a message:\
      </p>\
      <ul>\
        <li>IP address of the user</li>\
        <li>Date and time of registration</li>\
      </ul>\
      <p>\
        Your consent for data processing will be obtained, and you will be referred to this Privacy Notice during the\
        sending process.\
      </p><p>\
        Alternatively, it is possible to contact us using the email address provided.\
        The personal data of the user transferred with the email will be stored in this case.\
      </p><p>\
        The data is not transferred to third parties in this context.\
        The data is used exclusively for processing the correspondence.\
      </p><p>\
        <em>b)&nbsp;Legal basis for data processing</em>\
      </p><p>\
        The legal basis for processing of the data in the event that consent has been received from the user is set out\
        in Art. 6, paragraph 1, part (a) of the EU General Data Protection Regulation (GDPR).\
      </p><p>\
        The legal basis for processing of the data sent to us by email is set out in Art. 6, paragraph 1, part (f) of\
        the GDPR.\
        Where email contact is established with the intention of entering into a contract, additional legal bases for\
        the processing are set out in Art. 6, paragraph 1, part (b) of the GDPR.\
      </p><p>\
        <em>c)&nbsp;Purpose of data processing</em>\
      </p><p>\
        We use the personal data you provide in the contact form exclusively to process your enquiry.\
        In the case of contact by email, this represents our necessary, legitimate interest in data processing.\
      </p><p>\
       Any other personal data that is processed when you send us the contact form is used to prevent abuse of the\
        contact form and to protect the security of our Information Technology systems.\
      </p><p>\
        <em>d) Duration of storage</em>\
      </p><p>\
        The data is deleted as soon as it is no longer needed for the purpose for which it was collected.\
        For personal data entered in the input screen of the contact form and personal data sent to us by email, this\
        is the case when correspondence with the user has come to an end.\
        A conversation has come to an end when the circumstances indicate that the relevant matter has been dealt with\
        definitively.\
      </p><p>\
        Any additional personal data collected during the sending process will be deleted after a maximum of seven\
        days.\
      </p><p>\
        <em>e)&nbsp;Right to objection and removal</em>\
      </p><p>\
        The user is entitled to revoke their consent to the processing of personal data at any time.\
        The user may object to the processing of personal data at any time by contacting\
        datenschutz@dlr.de.&nbsp;Correspondence will be discontinued in these cases.\
      </p><p>\
        All personal data stored in connection with contacting us will be deleted in this case.\
      </p>\
      <p />\
        <strong>VIII. Rights of the data subject</strong>\
      </p><p>\
        Where personal data concerning you is processed, you are the data subject as defined in the EU General Data\
        Protection Regulation (GDPR) and you have the following rights with respect to the controller:\
      </p><p>\
        <em>a) Right to information</em>\
      </p><p>\
        You have the right to obtain from the controller confirmation of whether personal data concerning you is\
        processed by us.\
      </p><p>\
        Where such processing takes place, you have the right to obtain the following information from the\
        controller:\
      </p>\
      <ul>\
        <li>the purposes for which the personal data is processed;</li>\
        <li>the categories of personal data that is processed;</li>\
        <li>\
          the recipients, or categories of recipients to whom the personal data relating to you has been or will be\
          disclosed;\
        </li>\
        <li>\
          the planned duration of storage of the personal data concerning you, or the criteria applied to defining the\
          duration of storage if precise information in this regard is not available;\
        </li>\
        <li>\
          the existence of a right to correction or deletion of the personal data concerning you, the right to restrict\
          processing by the controller or the right to object to this processing;\
        </li>\
        <li>the right to lodge a complaint with a supervisory authority;</li>\
        <li>\
          all information available concerning the origins of the data if the personal data was not collected from the\
          data subject;\
        </li>\
        <li>\
          the existence of an automated decision-making process, including profiling, according to Art. 22 paragraphs 1\
          and 4 of the GDPR and – at least in these cases – meaningful information on the logic and implications\
          involved, as well as on the intended effects of this kind of processing on the data subject;\
        </li>\
        <li>\
          You also have the right to obtain information on whether the personal data concerning you has or will be\
          transferred to a third country or to an international organisation. In this regard, you are entitled to\
          request information on the appropriate guarantees in place with regard to this processing in accordance with\
          Art. 46 of the GDPR.\
        </li>\
      </ul>\
      <p>\
        The controller will provide a copy of the personal data that is subject to processing.\
        Where you request additional copies, the controller is entitled to charge an appropriate fee based on\
        administrative costs.\
        If you place the application by electronic means, the information will be made available in a standard\
        electronic format, except where otherwise specified by you.\
        The right to receive a copy in accordance with paragraph 3 of this section must not adversely affect the rights\
        and freedoms of other persons.\
      </p><p>\
        <em>b)&nbsp;Right to correction</em>\
      </p><p>\
        As a data subject, you have the right to request from the controller the correction of inaccurate personal data\
        concerning you without undue delay.\
        Taking into account the purposes of the processing, you have the right to have incomplete personal data\
        completed, including by means of providing a supplementary statement.\
      </p><p>\
        <em>c)&nbsp;Right to limit processing</em>\
      </p><p>\
        You have the right to request from the controller restriction of processing of personal data concerning you\
        under the following conditions:\
      </p>\
      <ul>\
        <li>\
          where the accuracy of the personal data is contested by you, for a period enabling the controller to verify\
          the accuracy of the personal data;\
        </li>\
        <li>\
          the processing is unlawful and you oppose the deletion of the personal data, and instead request the\
          restriction of its use;\
        </li>\
        <li>\
          the controller no longer needs the personal data for the purposes of the processing, but it is required by\
          you for the establishment, exercise or defence of legal claims; or\
        </li>\
         <li>\
          if you have objected to processing pursuant to Art. 21, paragraph 1, of the GDPR, pending the verification of\
          whether the legitimate reasons of the controller override your reasons.\
        </li>\
      </ul>\
      <p>\
        Where processing of the personal data concerning you has been restricted, such personal data shall, with the\
        exception of storage, only be processed with your consent or for the establishment, exercise or defence of\
        legal claims or for the protection of the rights of another natural or legal person or for reasons of important\
        public interest of the Union or of a Member State.\
      </p><p>\
        Where you have obtained restriction of processing under the conditions set out above, you will be informed by\
        the controller before the restriction of processing is lifted.\
      </p><p>\
        <em>d)&nbsp;Right to deletion</em>\
      </p><p>\
        Obligation to delete\
      </p><p>\
        You have the right to request the controller to delete personal data concerning you without undue delay, and\
        the controller will be obliged to delete personal data immediately where one of the following grounds applies:\
      </p>\
      <ul>\
        <li>\
          the personal data is no longer necessary in relation to the purposes for which it was collected or\
          otherwise processed;\
        </li>\
        <li>\
          you withdraw consent on which the processing is based according to part (a) of Art. 6, paragraph 1, or part\
          (a) of Art. 9, paragraph 2 of the GDPR, and there is no other legal basis for the processing;\
        </li>\
        <li>\
          you object to the processing pursuant to Art. 21, paragraph 1 of the GDPR and there are no overriding\
          legitimate grounds for the processing, or you object to the processing pursuant to Art. 21, paragraph 2 of\
          the GDPR;<br />\
          the personal data concerning you has been unlawfully processed;\
        </li>\
        <li>\
          the personal data has to be deleted to comply with a legal obligation under a Union&nbsp; or Member State law\
          to which the controller is subject;\
        </li>\
        <li>\
          The personal data concerning you has been collected in relation to the offer of information society services\
          referred to in Art. 8, paragraph 1 of the GDPR.\
        </li>\
        <li>Information to third parties</li>\
      </ul>\
      <p>\
        Information to third parties\
      </p><p>\
        Where the controller has made the personal data concerning you public and is obliged pursuant to Art. 17,\
        paragraph 1 of the GDPR to delete the personal data, the controller, taking account of available technology and\
        the cost of implementation, is required to take reasonable steps, including technical measures, to inform\
        controllers who are processing the personal data that you have requested to be deleted by such controllers, as\
        well as any links to, copies or replications of such personal data.\
      </p><p>\
        Exceptions\
      </p><p>\
        The right to deletion does not apply to the extent that processing is necessary:\
      </p>\
      <ul>\
        <li>for exercising the right of freedom of expression and information;</li>\
        <li>\
          for compliance with a legal obligation under Union or Member State law to which the controller is subject or\
          for the performance of tasks carried out in the public interest or in the exercise of official authority\
          vested in the controller;\
        </li>\
        <li>\
          for reasons of public interest in the area of public health in accordance with parts (h) and (i) of Art. 9,\
          paragraph 2 and Art. 9, paragraph 3 of the GDPR;\
        </li>\
        <li>\
          for archiving purposes in the public interest, for scientific or historical research purposes or for\
          statistical purposes in accordance with Art. 89, paragraph 1 of the GDPR, insofar as the rights referred to\
          in section (a) are likely to render impossible or seriously impair the achievement of the objectives of that\
          processing; or\
        </li>\
        <li>for the establishment, exercise or defence of legal claims.</li>\
      </ul>\
      <p>\
        <em>e)&nbsp;Right to notification</em>\
      </p><p>\
        Where you have exercised the right to correction, deletion or restriction of processing with the data\
        controller, the data controller shall be obliged to notify all recipients to whom the personal data concerning\
        you was disclosed of this correction or deletion of data or of the restriction of processing, except where\
        compliance proves to be impossible or is associated with a disproportionate effort.\
      </p><p>\
        In addition, you are entitled to require that the data controller inform you about these recipients.\
      </p><p>\
        <em>f)&nbsp;Right to data portability</em>\
      </p><p>\
        You have the right to receive the personal data concerning you, which you have provided to the controller, in a\
        structured, commonly used and machine-readable format and have the right to transfer that data to another\
        controller without hindrance from the controller to which the personal data have been provided, where:\
      </p><p>\
        the processing is based on consent pursuant to part (a) of Article 6, paragraph 1 or part (a) of Article 9,\
        paragraph 2 of the GDPR or in a contract pursuant to part (b) of Art. 6, paragraph 1 of the GDPR; and<br />\
        the processing is carried out by automated means.<br />\
        In exercising your right to data portability, you have the right to have the personal data concerning you\
        transmitted directly from one controller to another, where technically feasible.\
        This must not adversely affect the rights and freedoms of other persons.\
        </p><p>\
        The right to data portability does not apply to processing that is necessary for the performance of a task\
        carried out in the public interest or in the exercise of official authority vested in the controller.\
      </p><p>\
        <em>g)&nbsp;<strong>Right to object</strong></em>\
      </p><p>\
        <strong>\
          You have the right to object, at any time, on grounds relating to your particular situation, to the\
          processing of personal data concerning you, which is based on parts (e) or (f) of Art. 6, paragraph 1 of the\
          GDPR; this includes profiling based on those provisions.\
        </strong>\
      </p><p>\
        <strong>\
          The controller shall no longer process the personal data concerning you, unless the controller demonstrates\
          compelling legitimate grounds for the processing which override your interests, rights and freedoms or for\
          the establishment, exercise or defence of legal claims.\
        </strong>\
      </p><p>\
        <strong>\
          Where personal data concerning you is processed for direct marketing purposes, you have the right to object,\
          at any time, to the processing of personal data concerning you for the purpose of such marketing.\
          This applies also to profiling to the extent that it is related to such direct marketing.\
        </strong>\
      </p><p>\
        <strong>\
          Where you object to processing for direct marketing purposes, the personal data will no longer be processed\
          for such purposes.\
        </strong>\
      </p><p>\
        <strong>\
          In the context of the use of information society services, and notwithstanding directive 2002/58/EC, you may\
          exercise your right to object by automated means that use technical specifications.\
        </strong>\
      </p><p>\
        <strong>\
          Where personal data is processed for scientific or historical research purposes or for statistical purposes\
          pursuant to Art. 89, paragraph 1 of the GDPR, you have the right, on grounds relating to your particular\
          situation, to object to processing of personal data concerning you, except where the processing is necessary\
          for the performance of a task carried out for reasons of public interest.\
        </strong>\
      </p><p>\
        <strong>\
          Should you wish to exercise your right to withdraw consent or to object, please send an email to\
          datenschutz@dlr.de.\
        </strong>\
      </p><p>\
        <em>h)&nbsp;Right to withdraw consent pursuant to Art. 7, paragraph 3 of the GDPR</em>\
      </p><p>\
        You have the right to withdraw your consent to the processing of data at any time, with future effect.\
        In the event that you withdraw consent, we will delete the data concerned immediately, except where processing\
        can be based on legal grounds that do not require consent.\
        The withdrawal of consent will not affect the lawfulness of processing carried out prior to withdrawal of\
        consent.\
      </p><p>\
        <em>i) Automated individual decision-making, including profiling</em>\
      </p><p>\
        You have the right not to be subject to a decision based solely on automated processing, including profiling,\
        which produces legal effects for you or similarly significantly affects you.\
      </p><p>\
        This does not apply if the decision:\
      </p>\
      <ul>\
        <li>is necessary for entering into, or performance of, a contract between you and the data controller;</li>\
        <li>\
          is authorised by Union or Member State law to which the controller is subject and which also contains\
          suitable measures to safeguard your rights, freedoms and legitimate interests; or\
        </li>\
        <li>is based on your explicit consent.</li>\
      </ul>\
      <p>\
        However, these decisions must not be based on special categories of personal data referred to in Art 9,\
        paragraph 1 of the GDPR, unless parts (a) or (g) of Art. 9, paragraph 2 of the GDPR applies and suitable\
        measures to safeguard your rights, freedoms and legitimate interests are in place.\
      </p><p>\
        In the cases referred to in parts (1) and (3), the data controller is required to implement suitable measures\
        to safeguard your rights, freedoms and legitimate interests, including at least the right to obtain human\
        intervention on the part of the controller, to express your own point of view and to contest the decision.\
      </p><p>\
        <em>j)&nbsp;Right to lodge a complaint with a supervisory authority</em>\
      </p><p>\
        Without prejudice to any other administrative or judicial remedy, you have the right to lodge a complaint with\
        a supervisory authority, in particular in the Member State of your normal residence, you place of work or the\
        place of the alleged infringement, if you consider that the processing of personal data relating to you\
        infringes the GDPR.\
      </p><p>\
        The supervisory authority with which the complaint has been lodged is required to inform the complainant on the\
        progress and the outcome of the complaint, including the possibility of a judicial remedy pursuant to Article\
        78.\
      </p>',
  },
  accessibility: {
    header: 'Accessibility',
    content: '\
      <p>\
        This accessibility statement is valid for the website of the German Aerospace Center (Deutsches Zentrum für Luft-\
        und Raumfahrt e. V.; DLR) published under www.DLR.de.\
      </p><p>\
        As a public sector body of the German Federal Government within the meaning of EU Directive 2016/2102, we\
        endeavour to make our websites and mobile applications accessible in accordance with the provisions set out in\
        the German Equality for Persons with Disabilities Act (BGG) and the German Barrier-Free Information Technology\
        Ordinance (BITV 2.0) in order to implement EU Directive 2016/2102.\
      </p>\
      <h2>Compliance status</h2>\
      <p>\
        The accessibility requirements stem from Sections 3 (1) to (4) and 4 of BITV 2.0, adopted on the basis of Section\
        12d BGG.\
      </p><p>\
        At present, the website is partially compliant with the aforementioned requirements.\
      </p><p>\
        The website is currently being reviewed with regard to accessibility.\
        It is therefore possible that not all accessibility requirements have been fully met.\
        We are working on addressing all identified accessibility problems.\
      </p>\
      <h2>Preparation of this accessibility statement</h2>\
      <p>\
        This statement was prepared on 21 September 2020.\
      </p>\
      <h2>Reporting barriers: feedback and contact information</h2>\
      <p>\
        Would you like to notify us of existing barriers or request information regarding the implementation \
        accessibility? <br />\
        If you would like to give us your feedback and for further information, please contact\
        <a href="mailto:barrierefreiheit@dlr.de" title="E-Mail: barrierefreiheit@dlr.de"><span>barrierefreiheit@dlr.de</span></a>.\
      </p>\
      <h2>Conciliation procedure</h2>\
      <p>\
        If no satisfactory solution is found following your feedback, then you can turn to the conciliation body,\
        pursuant to Section 16 BGG.\
        The BGG conciliation body is tasked with helping to settle accessibility-related disputes out of court between\
        people with disabilities and federal public bodies.\
        The conciliation procedure is free of charge.\
        No legal assistance is required.<br />\
        For more information on the conciliation procedure and the options for filing an application, please visit:\
        <a href="https://www.schlichtungsstelle-bgg.de" target="_blank" title="External link Schlichtungsstelle BGG">www.schlichtungsstelle-bgg.de</a>\
      </p>\
      <p>\
        You can contact the BGG conciliation body directly at:\
        <a href="mailto:info@schlichtungsstelle-bgg.de" target="_blank" title="External link Emailadresse Schlichtungsstelle BGG">info@schlichtungsstelle-bgg.de</a>\
      </p>\
      <p />\
      <p>\
        <strong>DISCLAIMER:</strong> The English version is a translation of the original in German for information\
        purposes only.\
        In case of a discrepancy, the German original will prevail.\
      </p>',
  },
  attribution: {
    header: 'Attribution',
    'thank-you-text': "\
      Several fantastic pieces of free and open-source software have really helped us to get the website to where it is\
      today!\
      We are grateful, that this is possible in today's world and collaboration around the globe is stronger than ever\
      before.\
      We want to express our gratitude to all those, who worked on the following software libraries.\
      You are doing great work!",
    authors: 'Author(s)',
    repository: 'Repository',
  },
}
