// SPDX-FileCopyrightText: 2024 German Aerospace Center (DLR)
// SPDX-License-Identifier: CC0-1.0

{
  welcomeModalSlides: {
    slide1: {
      title: 'Welcome!',
      content: '\n Thank you for using ESID. <br/>\n ESID is a platform designed to support you in your infection control tasks.<br/><br/>\n ✓ Complete first task. <br/>\n ✓ Understand next steps. \n ',
    },
    slide2: {
      title: 'ESID can support you: ',
      content: '✓ When monitoring the (local) infection incidence. <br/> ✓ In assessing how an infection dynamic is likely to change in the future. <br/> ✓ In planning effective (local) intervention strategies to contain an infectious disease. ',
    },
    slide3: {
      title: 'How does ESID help you with surveillance?',
      content: '✓ You can easily identify centres of infection on a map of Germany. <br/>✓ You can track the change in case numbers over time in a clear diagram. ',
    },
    slide4: {
      title: 'How does ESID help you with assessment?',
      content: '✓ You can view the expected future development of case numbers through various scenarios. ',
    },
    slide5: {
      title: 'How does ESID help you with planning?',
      content: '✓ You can consider different scenarios, for example with or without mandatory masking, and thus compare the likely future development of case numbers within these scenarios. <br/> ✓ You can derive an effective containment strategy from this comparison. ',
    },
    slide6: {
      title: 'Take an onboarding tour!',
      content: 'Click on the chips below to take a tour of the platform. You can always access the tours later by clicking on the help icon.',
    },
  },
  chooseTour: 'Choose a tour',
  maybeLater: 'Maybe later',
  toolTipText: 'Click here for additional information.',
  completedTours: 'You have completed all the onboarding tours.',
  completedToursContent: 'You can retake a tour anytime by clicking on the options below.',
  getStarted: 'Explore ESID through our onboarding tours',
  getStartedContent: "To help you get familiar with ESID, we've prepared several onboarding tours. Click on a tour below to explore key features and functionalities at your own pace.",
  completed: 'completed',
  next: 'Next',
  back: 'Back',
  skip: 'Skip',
  last: 'Last',
  tourAccessAlertTitle: 'Tour Notice',
  lineChartTourAlertMessage: 'You need to be on the Time series tab to start this tour.',
  parameterTourAlertMessage: 'You need to be on the Parameters tab to start this tour',
  tours: {
    districtMap: {
      title: 'Map',
      steps: {
        step1: {
          target: '#sidebar-root',
          title: 'Step 1',
          content: 'The map shows an overview of all rural and urban districts in Germany.  You can select a different district by clicking on it and display case data for specific regions.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right-start',
        },
        step2: {
          target: '#sidebar-root',
          title: 'Step 2',
          content: 'To get a more detailed overview, you can zoom in or out of the map using the plus or minus symbol or the mouse wheel. You can reset the map to its default view using the "Reset" button.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right',
        },
        step3: {
          target: '#side-bar-heat-legend',
          title: 'Step 3',
          content: 'The map also has a customisable colour legend. You can choose between different colour schemes here. The colour legend shows in which regions case numbers are very high, moderate or low. You can also lock the maximum value of the legend by clicking the lock sign. The case numbers in the map always refer to a specific infection status, which can be selected to the right of the map, as well as a specific date, which can be selected in the line chart using the blue-purple line.',
          disableBeacon: true,
          showProgress: true,
          placement: 'right',
        },
        step4: {
          target: '#sidebar-map-search-bar-wrapper',
          title: 'Step 4',
          content: 'The auto-complete search bar will help you to easily find the country or city district you are looking for. ',
          disableBeacon: true,
          showProgress: true,
          placement: 'right-start',
        },
      },
    },
    scenario: {
      title: 'Scenario',
      steps: {
        step1: {
          target: '#scenario-container',
          title: 'Step 1',
          content: 'The various scenario cards are displayed in this area. The scenarios show how an infection could develop in the future.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step2: {
          target: '#scenario-view-compartment-list-date',
          title: 'Step 2',
          content: 'The reference date is the starting point of the period from which changes in the number of cases can be viewed in the line chart. It is the reference point for an end point, which is represented by the blue-purple line in the line chart. The reference date is represented by a dashed line that leads to the line chart. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step3: {
          target: '#scenario-container',
          title: 'Step 3',
          content: 'Click on the calendar icon to change the reference date. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left-start',
          spotlightPadding: 50,
        },
        step4: {
          target: '#compartments-list',
          title: 'Step 4',
          content: 'Below the reference day there is a list of infection states, like infected, hospitalized, and dead. The value to the right of the infection status indicates the number of people with a corresponding infection status in a specific city or district on the reference day. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step5: {
          target: '#compartments-list',
          title: 'Step 5',
          content: 'Try clicking on the respective infection status to see how the map on the left and the line chart below change and adapt to the numerical values for the selected infection status.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom-start',
          disableOverlay: true,
        },
        step6: {
          target: '#card-container',
          title: 'Step 6',
          content: 'Each scenario cards shows case data for the various infection statuses. All values relate to a specific date and a specific urban or rural district. The baseline scenario shows the course of infection without measures. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step7: {
          target: '#main-card-external-container-0',
          title: 'Step 7',
          content: 'The "Estimated cases" scenario card shows the case numbers for various infection statuses for a specific date and a specific rural or urban district. This data is independent of any simulation scenarios and reflects the current situation to date. You can select an infection status to view its details.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step8: {
          target: '#card-container',
          title: 'Step 8',
          content: 'Try clicking on the checkmark on the bottom left of the card to activate a scenario card. That will display the scenario data in the line chart. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left-start',
          disableOverlay: true,
        },
        step9: {
          target: '#scenario-container',
          title: 'Step 9',
          content: 'The case data or scenario values indicate the number of people with a specific infection status within a specific scenario. In addition, all values relate to a selected rural or urban district and a selected date. The values of the scenarios are visualized in the line diagram and on the map. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom-start',
        },
        step10: {
          target: '#card-container',
          title: 'Step 10',
          content: 'Each scenario has a beginning and an end. The scenario of estimated cases (in black) starts one year earlier and ends on the current day. The base scenario starts on the current day and ends after 28 days. The period is represented in the line chart by a line in the color of the respective scenario. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left-start',
          disableOverlay: true,
        },
        step11: {
          target: '#scenario-add-button',
          title: 'Step 11',
          content: 'You can add a new scenario card using the "Add" button. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
      },
    },
    filter: {
      title: 'Filters',
      steps: {
        step1: {
          target: '#manage-filters-button',
          title: 'Step 1',
          content: 'The filter can be used to filter by different age groups. Click here to explore the filter options. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideCloseButton: true,
          hideFooter: true,
          placement: 'left-start',
        },
        step2: {
          target: '#manage-filters-dialog',
          title: 'Step 2',
          content: 'Here you can manage the filter options. You can select an existing filter card to edit or delete it, or you can add a new filter card. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideBackButton: true,
          placement: 'bottom',
        },
        step3: {
          target: '#group-filter-add-card',
          title: 'Step 3',
          content: 'You can add a new filter by clicking on this button. After selecting a filter, the filtered values are displayed in the scenario box. To do this, click on the arrow next to the scenario box to see the scenario values with the filter applied.',
          disableBeacon: true,
          showProgress: true,
          disableOverlayClose: true,
          spotlightClicks: false,
        },
      },
    },
    lineChart: {
      title: 'Line Chart',
      steps: {
        step1: {
          target: '#chartdiv',
          title: 'Step 1',
          content: 'This section represents a chart that compares the different scenarios over time in a selected district. The Y-axis shows the number of people with the corresponding infection status, the X-axis shows the time span.  Click Next to explore the line chart in more detail.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#chartdiv',
          title: 'Step 2',
          content: 'Hover over any point on the line to see detailed information for that specific day and scenario. This will give you an snapshot of the data at that point in time.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left-start',
        },
        step3: {
          target: '#chartdiv',
          title: 'Step 3',
          content: 'The chart dynamically updates when you change the scenario, infection status, or district.  Try selecting a different district or infection status to see how the chart updates in real-time.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'top-end',
          disableOverlay: true,
        },
        step4: {
          target: '#chartdiv',
          title: 'Step 4',
          content: "The purple line represents the scenario's values for a specific day. These values correspond to what's displayed on the map and in the scenario box.",
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left',
        },
        step5: {
          target: '#chartdiv',
          title: 'Step 5',
          content: 'Try clicking on the map to move the purple line to a different date. Observe how the values in the scenario cards and on the map change accordingly. These values always reflect the selected date. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'top-end',
          disableOverlay: true,
        },
        step6: {
          target: '#chartdiv',
          title: 'Step 6',
          content: 'Use your mouse to zoom in or out and explore different sections of the line chart in detail. You can also click and drag to select a specific area and zoom into it. To reset the chart to its default view, click the minus symbol.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'top-end',
        },
        step7: {
          target: '#chartdiv',
          title: 'Step 7',
          content: 'Uncertainties in predictions are shown as shaded areas. Zoom in on this area to explore the uncertainty quantifications in more detail. Note: a scenario must be activated and selected to see the uncertainties. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step8: {
          target: '#tab-list',
          title: 'Step 8',
          content: 'You can navigate between different areas using these tabs.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          spotlightClicks: false,
        },
      },
    },
    parameters: {
      title: 'Parameters',
      steps: {
        step1: {
          target: '#table-container',
          title: 'Step 1',
          content: 'In this "Parameters" tab, you can see a table with model parameters instead of the diagram. The listed parameters are used for modelling and thus for simulating the scenarios. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#table-container',
          title: 'Step 2',
          content: 'The parameters serve as basic information for experts with specific epidemiological knowledge. They can only be viewed, but not changed. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
      },
    },
  },
}
