// SPDX-FileCopyrightText: 2024 German Aerospace Center (DLR)
// SPDX-License-Identifier: CC0-1.0

{
  welcomeModalSlides: {
    slide1: {
      title: 'Welcome!',
      content: '\n Thank you for using ESID. <br/>\n ESID is a platform designed to support you in your infection control tasks.<br/><br/>\n ✓ Complete first task<br/>\n ✓ Understand next steps\n ',
    },
    slide2: {
      title: 'ESID can support you: ',
      content: '✓ When monitoring the (local) infection incidence. <br/> ✓ In assessing how an infection dynamic is likely to change in the future. <br/> ✓ in planning effective (local) intervention strategies to contain an infectious disease. ',
    },
    slide3: {
      title: 'How does ESID help you with surveillance?',
      content: '✓ You can easily identify centres of infection on a map of Germany. <br/>✓ You can track the change in case numbers over time in a clear diagram',
    },
    slide4: {
      title: 'How does ESID help you with assessment?',
      content: '✓ You can view the expected future development of case numbers through various scenarios',
    },
    slide5: {
      title: 'How does ESID help you with planning?',
      content: '✓ You can compare the expected future development of case numbers in the future by looking at different scenarios, for example with or without mandatory masks. <br/> ✓ You can derive an effective containment strategy from this comparison. ',
    },
    slide6: {
      title: 'Take an onboarding tour!',
      content: 'Click on the chips below to take a tour of the platform. You can always access the tours later by clicking on the help icon.',
    },
  },
  chooseTour: 'Choose a tour',
  maybeLater: 'Maybe later',
  toolTipText: 'This is the floating button for help.',
  completedTours: 'You have completed all the onboarding tours.',
  completedToursContent: 'You can retake a tour anytime by clicking on the options below.',
  getStarted: 'Explore ESID through our onboarding tours',
  getStartedContent: "To help you get familiar with ESID, we've prepared several onboarding tours. Click on a tour below to explore key features and functionalities at your own pace.",
  completed: 'completed',
  next: 'Next',
  back: 'Back',
  skip: 'Skip',
  last: 'Last',
  tourAccessAlertTitle: 'Tour Notice',
  lineChartTourAlertMessage: 'You need to be on the Time series tab to start this tour.',
  parameterTourAlertMessage: 'You need to be on the Parameters tab to start this tour',
  tours: {
    districtMap: {
      title: 'District Map',
      steps: {
        step1: {
          target: '#sidebar-root',
          title: 'Step 1',
          content: 'The district map shows a map of Germany. It serves as a choropleth map for geo-spatially distributed data by district. You can select a different district to filter data in other components. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right-start',
        },
        step2: {
          target: '#sidebar-root',
          title: 'Step 2',
          content: 'To get a more detailed overview, the map can be zoomed in or out using the plus or minus symbol or the mouse wheel. The reset button allows you to return the map to its default view.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right',
        },
        step3: {
          target: '#side-bar-heat-legend',
          title: 'Step 3',
          content: 'The district map also has a customizable heat legend, which allows you to select different color schemes. ',
          disableBeacon: true,
          showProgress: true,
          placement: 'right',
        },
        step4: {
          target: '#sidebar-map-search-bar-wrapper',
          title: 'Step 4',
          content: 'There is also a search bar with an auto-complete function which helps you to find the county without geographical knowledge. ',
          disableBeacon: true,
          showProgress: true,
          placement: 'right-start',
        },
      },
    },
    scenario: {
      title: 'Scenario',
      steps: {
        step1: {
          target: '#scenario-container',
          title: 'Step 1',
          content: 'This section represents the different scenario cards. 📊 Scenarios show a coherent picture of the possible development of an infection event. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step2: {
          target: '#scenario-view-compartment-list-date',
          title: 'Step 2',
          content: 'The reference date is used to visualize changes in the incidence of infection over time. The reference date forms the reference to the selected day in the line chart (illustrated by the purple line). The reference date is also shown with a dashed line leading up to the line chart. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step3: {
          target: '#scenario-container',
          title: 'Step 3',
          content: 'Click on the calendar icon to change the reference date. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left-start',
          hideCloseButton: true,
          hideFooter: true,
        },
        step4: {
          target: '#compartments-list',
          title: 'Step 4',
          content: 'Below the reference day there is a list of infection states, like infected, hospitalized, and dead. The value to the right of the infection status indicates the number of people with a corresponding infection status in a specific city or district. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step5: {
          target: '#compartments-list',
          title: 'Step 5',
          content: 'Try clicking on the respective infection status to see how the map on the left and the line chart below change and adapt to the numerical values for the selected infection status. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'right-start',
        },
        step6: {
          target: '#card-container',
          title: 'Step 6',
          content: 'The scenario cards display the data for a chosen scenario across all compartments, on a specific date, and for a specific district. The baseline scenario (blue) depicts the infection process without measures. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step7: {
          target: '#main-card-external-container-0',
          title: 'Step 7',
          content: 'The estimated cases card displays data for a chosen compartment, on a specific date, and for a specific district, without any scenario-specific data. It allows you to select a compartment to focus on. The data for the estimated cases scenario shows data up to the present day.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step8: {
          target: '#card-container',
          title: 'Step 8',
          content: 'Try clicking on the checkmark on the bottom left of the card to activate a scenario card. That will display the scenario data in the line chart. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step9: {
          target: '#card-container',
          title: 'Step 9',
          content: 'Different values of the infection status are shown in the scenario box. Those values indicate the number of people with a specific infection status within a specific scenario. You can see them visualized in the line diagram below and on the map. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
        step10: {
          target: '#card-container',
          title: 'Step 10',
          content: 'Each scenario has a start and end. The estimated cases scenario (in black) starts one year earlier and ends on the current day. The base scenario (in blue) starts on the current day and ends after 28 days. The time period is illustrated by a line in the respective scenario color in the line chart',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom-start',
        },
        step11: {
          target: '#scenario-add-button',
          title: 'Step 11',
          content: 'The add button allows you to add a new scenario card to the scenario container. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'bottom',
        },
      },
    },
    filter: {
      title: 'Filters',
      steps: {
        step1: {
          target: '#manage-filters-button',
          title: 'Step 1',
          content: 'Filters provide configurable options for age group-based filtering. It allows you to filter the data based on age groups. Click here to explore the filter options. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideCloseButton: true,
          hideFooter: true,
          placement: 'left-start',
        },
        step2: {
          target: '#manage-filters-dialog',
          title: 'Step 2',
          content: 'Here you can manage the filter options. You can select an existing filter card to edit or delete it, or you can add a new filter card. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          disableOverlayClose: true,
          hideBackButton: true,
          placement: 'bottom',
        },
        step3: {
          target: '#group-filter-add-card',
          title: 'Step 3',
          content: 'A new filter can be added by clicking on this button. After selecting a filter, the filtered values are displayed in the scenario box, which can be seen by clicking the arrow next to the scenario box to display the scenario values with the filter applied. ',
          disableBeacon: true,
          showProgress: true,
          disableOverlayClose: true,
          spotlightClicks: false,
        },
      },
    },
    lineChart: {
      title: 'Line Chart',
      steps: {
        step1: {
          target: '#chartdiv',
          title: 'Step 1',
          content: 'This section represents a chart that compares the different scenarios over time in a selected district. The Y-axis shows the number of people with the corresponding infection status, the X-axis shows the time span.  Click Next to explore the line chart in more detail.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#chartdiv',
          title: 'Step 2',
          content: 'Hover over any point on the line to see detailed information for that specific day and scenario. This will give you an snapshot of the data at that point in time.  ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'left-start',
        },
        step3: {
          target: '#chartdiv',
          title: 'Step 3',
          content: 'The chart dynamically updates when you change the scenario, infection status, or district.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'top-start',
        },
        step4: {
          target: '#chartdiv',
          title: 'Step 4',
          content: "The purple line represents the scenario's values for a specific day. These values correspond to what's displayed on the map and in the scenario box.",
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'top',
        },
        step5: {
          target: '#chartdiv',
          title: 'Step 5',
          content: 'Try moving the purple line to a different date. Observe how the values in the scenario cards and on the map change accordingly. These values always reflect the selected date. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
          placement: 'top-end',
        },
        step6: {
          target: '#chartdiv',
          title: 'Step 6',
          content: 'Uncertainties in predictions are shown as shaded areas. Zoom in on this area to explore the uncertainty quantifications in more detail. Note: a scenario must be activated and selected to see the uncertainties. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step7: {
          target: '#chartdiv',
          title: 'Step 7',
          content: 'Use your mouse to zoom in or out and explore different sections of the line chart in detail. You can also click and drag to select a specific area and zoom into it. To reset the chart to its default view, click the minus symbol.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step8: {
          target: '#tab-list',
          title: 'Step 8',
          content: 'You can navigate between different areas using these tabs.',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
      },
    },
    parameters: {
      title: 'Parameters',
      steps: {
        step1: {
          target: '#table-container',
          title: 'Step 1',
          content: 'In this "Parameters" view, a table with model parameters is visible instead of the diagram. The listed parameters are used for modelling and thus for simulating the scenarios ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
        step2: {
          target: '#table-container',
          title: 'Step 2',
          content: 'The parameters serve as basic information for specialists with specific epidemiological knowledge. They can only be viewed, but not changed. ',
          disableBeacon: true,
          spotlightClicks: true,
          showProgress: true,
        },
      },
    },
  },
}
